<a href="https://colab.research.google.com/github/ZeyadSabbah/TrivagoRecommenderSystem/blob/master/FeatureEngineeringMore.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Feature Engineering

## Mounting to Drive

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [2]:
%cd /content/drive/My Drive/Trivago/Project/TrivagoRecommenderSystem

/content/drive/My Drive/Trivago/Project/TrivagoRecommenderSystem

## Loading Libraries & Datasets

In [0]:
import pandas as pd
import numpy as np

In [4]:
item_metadata_filepath = './Datasets/raw_data/item_metadata.csv'
item_metadata = pd.read_csv(item_metadata_filepath)

train_filepath = './Datasets/raw_data/Sets/train.csv'
train = pd.read_csv(train_filepath)
train.head()

        user_id     session_id   timestamp  ...  current_filters impressions prices
0  00RL8Z82B2Z1  aff3928535f48  1541037460  ...              NaN         NaN    NaN
1  00RL8Z82B2Z1  aff3928535f48  1541037522  ...              NaN         NaN    NaN
2  00RL8Z82B2Z1  aff3928535f48  1541037522  ...              NaN         NaN    NaN
3  00RL8Z82B2Z1  aff3928535f48  1541037532  ...              NaN         NaN    NaN
4  00RL8Z82B2Z1  aff3928535f48  1541037532  ...              NaN         NaN    NaN

[5 rows x 12 columns]

## Train More

What differs the most is the Final Clickout, but what if the customer wanted to book more than one hotel in the same country as they are going to have a long trip, so for the same session and different values of the cities the items are being looked up by the user, there is a high chance that the user is satisfies with the final item they selected in the each city. Data used can be increased by considering the final clickout in the other cities besides the final city.

In [5]:
trainMoreFClickout = train[train.action_type=='clickout item'].groupby('session_id')
trainMoreFClickout = (trainMoreFClickout.city.nunique()>1).to_frame().rename(columns={'city':'MoreFClickout'}).reset_index()
trainMoreFClickout = trainMoreFClickout[trainMoreFClickout.MoreFClickout==True]
trainMoreFClickout = train[train.session_id.isin(trainMoreFClickout.session_id.tolist())]
MoreFClickout = trainMoreFClickout[trainMoreFClickout.action_type=='clickout item'].groupby(['session_id', 'city']).tail(1)
MoreFClickout.head(3)

           user_id  ...                                             prices
947   1R2O77QTOU5A  ...  42|34|113|54|103|44|43|41|42|45|51|46|20|51|43...
956   1R2O77QTOU5A  ...  103|51|41|70|113|42|34|44|42|37|51|42|29|18|46...
2093  4GVU9AT4RVBW  ...  89|69|110|126|75|98|61|84|52|96|80|88|57|84|14...

[3 rows x 12 columns]

In [6]:
#changening session_id
c = MoreFClickout.groupby('session_id').cumcount()
c = c.replace(0, '').astype(str)
MoreFClickout['session_id'] += c
MoreFClickout.head(3)

           user_id  ...                                             prices
947   1R2O77QTOU5A  ...  42|34|113|54|103|44|43|41|42|45|51|46|20|51|43...
956   1R2O77QTOU5A  ...  103|51|41|70|113|42|34|44|42|37|51|42|29|18|46...
2093  4GVU9AT4RVBW  ...  89|69|110|126|75|98|61|84|52|96|80|88|57|84|14...

[3 rows x 12 columns]

In [7]:
MoreFClickout[['user_id', 'session_id', 'city']]

               user_id      session_id                      city
947       1R2O77QTOU5A   484dfe03115ba         Guarulhos, Brazil
956       1R2O77QTOU5A  484dfe03115ba1         São Paulo, Brazil
2093      4GVU9AT4RVBW   b42f4cd99975e    Amsterdam, Netherlands
2100      4GVU9AT4RVBW  b42f4cd99975e1      Utrecht, Netherlands
2349      52IZXNUIF0NL   60f16cf8330b7              Tokyo, Japan
...                ...             ...                       ...
10665708  Y813RRM1N7P2  219a868ad5a611           Santiago, Chile
10665804  YIRGODEF6SO6   b8c521849e3c2         Dortmund, Germany
10665826  YIRGODEF6SO6  b8c521849e3c21          Luebeck, Germany
10665866  Z6W0KZ1LCB8H   a4c049a08e980  Murray Bridge, Australia
10665908  Z6W0KZ1LCB8H  a4c049a08e9801       Adelaide, Australia

[50801 rows x 3 columns]

In [9]:
trainMoreFClickout = trainMoreFClickout.rename(columns={'session_id':'old_session_id'})\
                     .merge(MoreFClickout[['user_id', 'session_id', 'city']], on=['user_id', 'city'], how='left')\
                     .drop(columns='old_session_id')
cols = train.columns.tolist()
trainMoreFClickout = trainMoreFClickout[cols]
trainMoreFClickout.head()

        user_id  ...                                             prices
0  1R2O77QTOU5A  ...  42|34|113|54|103|44|43|41|42|45|51|46|20|51|43...
1  1R2O77QTOU5A  ...                                                NaN
2  1R2O77QTOU5A  ...  103|51|41|70|113|42|34|44|42|37|51|42|29|18|46...
3  1R2O77QTOU5A  ...  103|51|41|70|113|42|34|44|42|37|51|42|29|18|46...
4  1R2O77QTOU5A  ...                                                NaN

[5 rows x 12 columns]

In [10]:
# Concatenating trainMoreFClickout to train
trainMore = pd.concat([train, trainMoreFClickout]).drop_duplicates()
trainMore.head(2)

        user_id     session_id   timestamp  ...  current_filters impressions prices
0  00RL8Z82B2Z1  aff3928535f48  1541037460  ...              NaN         NaN    NaN
1  00RL8Z82B2Z1  aff3928535f48  1541037522  ...              NaN         NaN    NaN

[2 rows x 12 columns]

## Important Dataframes Preparation

In engineer global features from the train dataset, which will be most of the cases around either clickouts or final click out examples (instances), two dataframes of them will be created.

In order to get representative global values to the items, duplicates must be removed. Rows would not all be duplicated because of some attributes such as timestamp, reference, and step.

In [0]:
ClickoutDF = trainMore[trainMore.action_type=='clickout item']
FinalClickoutDF = trainMore[trainMore.action_type=='clickout item'].groupby('session_id').tail(1)
ClickoutUniqueDF = ClickoutDF.drop_duplicates(subset=['session_id', 'impressions'], keep='first')

## Applying transform_data Function

All the functions are saved in a class that can be imported and apply the function in just one line.

In [12]:
from data_transformation import data_transformation

TrainMoreData = data_transformation.transform_data(trainMore)
TrainMoreData

/content/drive/My Drive/Trivago/Project/TrivagoRecommenderSystem/data_transformation.py:17: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  item_id['impressions'] = item_id['impressions'].apply(lambda x: x.split('|'))
/content/drive/My Drive/Trivago/Project/TrivagoRecommenderSystem/data_transformation.py:35: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  price['prices'] = price['prices'].apply(lambda x: x.split('|'))
/content/drive/My Drive/Trivago/Project/TrivagoRecommenderSystem/data_transformation.py:44: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  item_rank['impressions'] = item_rank['impressions'].apply(lambda x: x.split('|'))
/content/drive/My Drive/Trivago/Project/TrivagoRecommenderSystem/data_transformation.py:45: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  item_rank['impressions'] = item_rank['impressions'].apply(lambda x: list(range(1, len(x) + 1)))

              session_id  item_id  price  ... MaxPrice MinPrice  AveragePriceRank
0          aff3928535f48    55109    162  ...   1905.0     65.0         11.840753
1          aff3928535f48   129343     25  ...    388.0     18.0         10.166667
2          aff3928535f48    54824    150  ...    408.0     42.0         11.291196
3          aff3928535f48  2297972    143  ...    183.0    101.0          9.647059
4          aff3928535f48   109014    101  ...    628.0     70.0         11.262887
...                  ...      ...    ...  ...      ...      ...               ...
13192212  a4c049a08e9801  1425092     84  ...    156.0     54.0         11.500000
13192213  a4c049a08e9801  1627067     94  ...    216.0     59.0         11.031746
13192214  a4c049a08e9801  4201464    143  ...    158.0     92.0          8.000000
13192215  a4c049a08e9801  2106906    137  ...    137.0    137.0          0.000000
13192216  a4c049a08e9801  6474758    119  ...    222.0    119.0         10.071429

[13192217 rows x 25 columns]